---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsSystemBaseElementParam
source: html/b20c445c-f3d4-6b56-3f6d-c79bfe200eef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsSystemBaseElementParam Property

"System Equipment"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsSystemBaseElementParam { get; }
```